# Используйте официальный образ Python в качестве базового образа
FROM python:3.8

# Установите рабочую директорию внутри контейнера
WORKDIR /app

# Скопируйте зависимости проекта в контейнер
COPY requirements.txt .

# Установите зависимости приложения
RUN pip install --no-cache-dir -r requirements.txt

# Скопируйте все файлы вашего приложения в контейнер
COPY . .

# Определите переменные окружения
ENV FLASK_APP=app.py

# Указываем порт, на котором будет работать приложение
EXPOSE 5000

# Запустите приложение Flask при старте контейнера
CMD ["flask", "run", "--host=0.0.0.0"]
